# Реализуйте код, который печатает на экран случайное число в диапазоне от 1 до 10 включительно.

from random import randint

print(randint(0,10))